app/controllers/car_controller.rb

    def index
        car = Car.all
---
SELECT "cars".* FROM "cars"

    def show
        car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = 3 LIMIT 1